-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Июл 31 2020 г., 18:51
-- Версия сервера: 10.4.6-MariaDB
-- Версия PHP: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test-task`
--

-- --------------------------------------------------------

--
-- Структура таблицы `admin`
--

CREATE TABLE `admin` (
  `id` int(11) NOT NULL,
  `login` varchar(10) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `admin`
--

INSERT INTO `admin` (`id`, `login`, `password`) VALUES
(3, 'admin', '$2y$10$bACRoT.4cmDzEPt5QVXZue6.RD13VHEpNoGdPakQ96Fdyj4Ymoeo2');

-- --------------------------------------------------------

--
-- Структура таблицы `currency`
--

CREATE TABLE `currency` (
  `valuteID` longtext NOT NULL,
  `numCode` longtext NOT NULL,
  `charCode` longtext NOT NULL,
  `name` longtext NOT NULL,
  `value` longtext NOT NULL,
  `date` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `currency`
--

INSERT INTO `currency` (`valuteID`, `numCode`, `charCode`, `name`, `value`, `date`) VALUES
('R01010', '036', 'AUD', 'Австралийский доллар', '52,3521', '31.07.2020'),
('R01020A', '944', 'AZN', 'Азербайджанский манат', '43,1803', '31.07.2020'),
('R01035', '826', 'GBP', 'Фунт стерлингов Соединенного королевства', '95,2329', '31.07.2020'),
('R01060', '051', 'AMD', 'Армянских драмов', '15,1452', '31.07.2020'),
('R01090B', '933', 'BYN', 'Белорусский рубль', '30,0817', '31.07.2020'),
('R01100', '975', 'BGN', 'Болгарский лев', '44,0726', '31.07.2020'),
('R01115', '986', 'BRL', 'Бразильский реал', '14,1891', '31.07.2020'),
('R01135', '348', 'HUF', 'Венгерских форинтов', '24,9429', '31.07.2020'),
('R01200', '344', 'HKD', 'Гонконгских долларов', '94,6611', '31.07.2020'),
('R01215', '208', 'DKK', 'Датская крона', '11,5821', '31.07.2020'),
('R01235', '840', 'USD', 'Доллар США', '73,3633', '31.07.2020'),
('R01239', '978', 'EUR', 'Евро', '86,2532', '31.07.2020'),
('R01270', '356', 'INR', 'Индийских рупий', '98,0276', '31.07.2020'),
('R01335', '398', 'KZT', 'Казахстанских тенге', '17,4620', '31.07.2020'),
('R01350', '124', 'CAD', 'Канадский доллар', '54,7120', '31.07.2020'),
('R01370', '417', 'KGS', 'Киргизских сомов', '95,5156', '31.07.2020'),
('R01375', '156', 'CNY', 'Китайский юань', '10,4724', '31.07.2020'),
('R01500', '498', 'MDL', 'Молдавских леев', '43,8645', '31.07.2020'),
('R01535', '578', 'NOK', 'Норвежских крон', '80,5128', '31.07.2020'),
('R01565', '985', 'PLN', 'Польский злотый', '19,5427', '31.07.2020'),
('R01585F', '946', 'RON', 'Румынский лей', '17,8265', '31.07.2020'),
('R01589', '960', 'XDR', 'СДР (специальные права заимствования)', '103,2068', '31.07.2020'),
('R01625', '702', 'SGD', 'Сингапурский доллар', '53,3125', '31.07.2020'),
('R01670', '972', 'TJS', 'Таджикских сомони', '71,1402', '31.07.2020'),
('R01700J', '949', 'TRY', 'Турецкая лира', '10,5090', '31.07.2020'),
('R01710A', '934', 'TMT', 'Новый туркменский манат', '20,9909', '31.07.2020'),
('R01717', '860', 'UZS', 'Узбекских сумов', '71,8709', '31.07.2020'),
('R01720', '980', 'UAH', 'Украинских гривен', '26,4845', '31.07.2020'),
('R01760', '203', 'CZK', 'Чешских крон', '32,8167', '31.07.2020'),
('R01770', '752', 'SEK', 'Шведских крон', '83,6039', '31.07.2020'),
('R01775', '756', 'CHF', 'Швейцарский франк', '80,2223', '31.07.2020'),
('R01810', '710', 'ZAR', 'Южноафриканских рэндов', '43,7066', '31.07.2020'),
('R01815', '410', 'KRW', 'Вон Республики Корея', '61,3677', '31.07.2020'),
('R01820', '392', 'JPY', 'Японских иен', '69,8067', '31.07.2020'),
('R01010', '036', 'AUD', 'Австралийский доллар', '52,8154', '01.08.2020'),
('R01020A', '944', 'AZN', 'Азербайджанский манат', '43,2172', '01.08.2020'),
('R01035', '826', 'GBP', 'Фунт стерлингов Соединенного королевства', '96,3277', '01.08.2020'),
('R01060', '051', 'AMD', 'Армянских драмов', '15,0958', '01.08.2020'),
('R01090B', '933', 'BYN', 'Белорусский рубль', '30,0890', '01.08.2020'),
('R01100', '975', 'BGN', 'Болгарский лев', '44,5547', '01.08.2020'),
('R01115', '986', 'BRL', 'Бразильский реал', '14,2428', '01.08.2020'),
('R01135', '348', 'HUF', 'Венгерских форинтов', '25,2823', '01.08.2020'),
('R01200', '344', 'HKD', 'Гонконгских долларов', '94,7421', '01.08.2020'),
('R01215', '208', 'DKK', 'Датская крона', '11,7064', '01.08.2020'),
('R01235', '840', 'USD', 'Доллар США', '73,4261', '01.08.2020'),
('R01239', '978', 'EUR', 'Евро', '87,2889', '01.08.2020'),
('R01270', '356', 'INR', 'Индийских рупий', '98,1379', '01.08.2020'),
('R01335', '398', 'KZT', 'Казахстанских тенге', '17,4086', '01.08.2020'),
('R01350', '124', 'CAD', 'Канадский доллар', '54,7180', '01.08.2020'),
('R01370', '417', 'KGS', 'Киргизских сомов', '95,6287', '01.08.2020'),
('R01375', '156', 'CNY', 'Китайский юань', '10,5204', '01.08.2020'),
('R01500', '498', 'MDL', 'Молдавских леев', '44,1927', '01.08.2020'),
('R01535', '578', 'NOK', 'Норвежских крон', '81,1374', '01.08.2020'),
('R01565', '985', 'PLN', 'Польский злотый', '19,7653', '01.08.2020'),
('R01585F', '946', 'RON', 'Румынский лей', '18,0311', '01.08.2020'),
('R01589', '960', 'XDR', 'СДР (специальные права заимствования)', '103,3149', '01.08.2020'),
('R01625', '702', 'SGD', 'Сингапурский доллар', '53,5605', '01.08.2020'),
('R01670', '972', 'TJS', 'Таджикских сомони', '71,1838', '01.08.2020'),
('R01700J', '949', 'TRY', 'Турецкая лира', '10,5231', '01.08.2020'),
('R01710A', '934', 'TMT', 'Новый туркменский манат', '21,0089', '01.08.2020'),
('R01717', '860', 'UZS', 'Узбекских сумов', '71,9321', '01.08.2020'),
('R01720', '980', 'UAH', 'Украинских гривен', '26,5196', '01.08.2020'),
('R01760', '203', 'CZK', 'Чешских крон', '33,2930', '01.08.2020'),
('R01770', '752', 'SEK', 'Шведских крон', '84,7016', '01.08.2020'),
('R01775', '756', 'CHF', 'Швейцарский франк', '80,7946', '01.08.2020'),
('R01810', '710', 'ZAR', 'Южноафриканских рэндов', '43,4922', '01.08.2020'),
('R01815', '410', 'KRW', 'Вон Республики Корея', '61,7000', '01.08.2020'),
('R01820', '392', 'JPY', 'Японских иен', '70,1870', '01.08.2020');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `currency`
--
ALTER TABLE `currency`
  ADD UNIQUE KEY `valuteID` (`valuteID`,`date`) USING HASH;

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
